INSERT INTO students (full_name, furigana, nickname, email, city, age, gender)
VALUES  ('山田太郎', 'ヤマダタロウ', 'たろう', 'taro@example.com', '大阪市', 25, '男性'),
       ('鈴木花子', 'スズキハナコ', 'はなちゃん', 'hanako@example.com', '東京都', 22, '女性'),
       ('田中一郎', 'タナカイチロウ', 'いちろう', 'ichiro@example.com', '名古屋市', 30, '男性'),
       ('佐藤美咲', 'サトウミサキ', 'みさき', 'misaki@example.com', '福岡市', 28, '女性'),
       ('高橋翔', 'タカハシショウ', 'しょう', 'sho@example.com', '札幌市', 35, 'その他'),
       ('渡辺美咲', 'ワタナベミサキ', 'みさ', 'misaki.w@example.com', '埼玉県', 26, '女性'),
       ('渡辺美里', 'ワタナベミサト', 'みさ', 'misaki.w@example.com', '埼玉県', 26, '女性'),
       ('渡辺美由紀', 'ワタナベミユキ', 'みゆ', 'misaki.w@example.com', '埼玉県', 26, '女性');

INSERT INTO students_courses (student_id, course, start_date, expected_end_date)
VALUES (1, 'Java応用', '2025-09-30 00:00:00', '2026-08-01 00:00:00'),
       (2, 'Python', '2026-04-01 00:00:00', '2026-12-31 00:00:00'),
       (3, 'AWS', '2026-03-01 00:00:00', '2026-09-01 00:00:00'),
       (4, 'Java', '2026-05-01 00:00:00', '2026-11-01 00:00:00'),
       (5, 'Python', '2026-06-01 00:00:00', '2026-12-01 00:00:00'),
       (1, 'Django', '2026-06-01 00:00:00', '2026-12-01 00:00:00'),
       (1, 'AWS', '2026-06-01 00:00:00', '2026-12-01 00:00:00'),
       (6, 'Python', '2026-07-09 00:00:00', '2027-01-09 00:00:00'),
       (1, 'Python', '2026-06-01 00:00:00', '2026-12-01 00:00:00'),
       (7, 'AWS', '2026-08-09 00:00:00', '2027-08-09 00:00:00'),
       (8, 'AWS', '2026-08-09 00:00:00', '2027-08-09 00:00:00');